package Archive;

public class Veschestvennie_Chisla1 {

        public static void main(String[] args)  {

            float f = 0.0f;// f в конце значит что число типа float.
            for (int i=1; i <= 7; i++) {
                f +=.1111111111111111;// 0,111 =.111
            }
            System.out.println(f);// выведет 0.777_7778 - потому что точность float - 7 знаков после ",".
            double d = 0.0;
            for (int i=1; i <= 7; i++) {
                d +=.1111111111111111; // выведет 0.7777_7777_7777_7779 точность double - 16 знаков после ",".
            }

            System.out.println(d);
        }
    }

// a = a + b;
// f = f + 0.1111111111111111
// f + = 0.1111111111111111

// 1) 0 + 0.1111111111111111
// 2) 0.111_111_111_111_1111 + 0.111_111_111_111_1111
// 3) 0.222_222_222_222_2222 + 0.111_111_111_111_1111
// 4) 0.333_333_333_333_3333 + 0.111_111_111_111_1111
// 5) 0.444_444_444_444_4444 + 0.111_111_111_111_1111
// 6) 0.555_555_555_555_5555 + 0.111_111_111_111_1111
// 7) 0.666_666_666_666_6666 + 0.111_111_111_111_1111
// В итоге должно вывести в консоль:  0.777_777_777_777_7777