package Archive.Exception.Car2;


public class Main {
    public static void main(String[] args) {

        try (Car car = new Car()) {
            car.drive();
        } catch (RuntimeException e) {
        }
    }

    public static class Car implements AutoCloseable {
        @Override
        public void close() {
            System.out.println("Машина закрывается...");
        }

        public void drive() {
            System.out.println("Машина поехала.");
        }
    }
}


    /*Создайте статический класс Car, чтобы объекты этого типа можно было использовать в try-with-resources.
        Метод close() должен выводить на экран фразу "Машина закрывается...".
        Try должен ловить все непроверяемые исключения и игнорировать их.
        В методе main в блоке try вызови метод drive(). Метод drive должен выводить на экран сообщение "Машина поехала."*/
