package Archive._2PrimitiveTypes.MassiviStroki.Teoriya;

public class Stroka2 {
    public static void main(String[] args) {
        System.out.print("java");
        System.out.print("\r");
        System.out.print("\bЌовый текст\b");
        System.out.println("");
    }
}
/*
\\b   -   ѕозици€, соответствующа€ границе слова
\\B   -   ѕозици€, не соответствующа€ границе слова
\\n   -   —оответствует символу новой строки
\\r   -   —оответствует символу возврата коретки
\\t   -   —оответствует символу табул€ции
\\f   -   —оответствует символу конца файла
\\d   -   —оответствует любой дес€тичной цифре
\\D   -   —оответствует любому символу кроме дес€тичной цифры
\\w   -   —оответствует любому алфавитно-символьному символу и символу подчеркивани€, т.е. символ образующий "слово"
\\W   -   —оответствует всем символам, которые не попадают под определение метасимвола \W
\\s   -   —оответствует любому пробельному символу
\\S   -   —оответствует любому непробельному символу
 */
    /*  \t  Ч —имвол табул€ции (в java Ц эквивалент четырех пробелов);
        \b Ч —имвол возврата в тексте на один шаг назад или удаление одного символа в строке (backspace);
        \n Ч —имвол перехода на новую строку;
        \r Ч —имвол возврата каретки;
        \fЧ ѕрогон страницы к началу следующей страницы;
        \Т Ч —имвол одинарной кавычки;
        \Ф Ч —имвол двойной кавычки;
        \\ Ч —имвол обратной косой черты (\).*/
