package JavaRush;

public class task0602Method2 {
    public static void main(String[] args) {
        //напишите тут ваш код
        print1();
        print2();
    }
    public static void print1(){
        System.out.println("я Ч поэт, зовусь € ÷ветик.");
    }
    public static void print2(){
        System.out.println("ќт мен€ вам всем приветик.");
    }
}
    /*ѕеред тобой Ч плохой пример использовани€ методов:

        ћетоды разделили двустишие;
        ќдну строку кода не стоит оборачивать в отдельный метод.
        ѕерепиши код так, чтобы весь текст выводилс€ в методе main, а остальные методы удали.
        ¬ывод программы не должен изменитьс€.
        “ребовани€:
        Х	ћетод main() должен быть единственным методом в классе Solution.
        Х	¬ывод в консоли должен соответствовать условию задачи.*/