package Archive.PreProject;

// https://www.w3schools.com/sql/

// 1) Читаем про SQL https://sql-academy.org/ru/guide/basic-database-concepts
// 3) Смотрим про паттерн MVC (для визуалов ок) https://www.youtube.com/watch?v=eXl-jSSJs-Y
// 4) (DAO, CRUD и т.д.), смотрим Алишева про архитектуру работы с базами данных, https://youtu.be/D58pIymCew4
// 5) Базовый курс JDBC (7 коротких видео уроков от установки MySQL до первой таблицы) https://youtu.be/7LwOvVPavWA


// ------------java код ->
//          - стандарт JDBC - это Java API для работы с базами данных->
//          - СУБД (ПО - MySQL, Oracle и пр.) ->
//          - SQL (язык для SQL запросов для взаимодействия с БД) ----> БД --------------------------

//     СУБД (Система Управления Базами Данных) – это программное обеспечение, которое позволяет работать с базами данных
//     (например, MySQL, PostgreSQL, Oracle).

public class DataBase {
    public static void main(String[] args) {
    }
}

class Maven {

}

class JDBC {      // -----------JDBC--------------Стандарт написания кода JAVA
/*

    JDBC - УНИВЕРСАЛЬНЫЙ ИНТЕРФЕЙС ДЛЯ ДОСТУПА К БАЗЕ ДАННЫХ. Все производители баз данных должны реализовать интерфейс
    JDBC, что бы к их базам данных можно было обращаться из джава кода.
    https://youtu.be/kVzcaiq_9Fw?si=gmhBo0ae2-fkpUNG&t=180

    JDBC расшифровывается как Java DataBase Connectivity. Говоря дословно – соединения с «хранилищами электронных
    структурированных материалов» в Джаве. Это – платформенно-независимый стандарт. Используется для того, чтобы
    обеспечивать взаимодействие Java-контента со всевозможными СУБД.

    Имеет реализацию в виде пакета java.sql. Он включен в состав Java SE. В первом ряду при работе с соответствующим
    элементом выступает SQL. Но и MySQL тоже весьма хорошо функционирует вместе с JDBC.

    */
}

class SQL {      // ---------SQL----------------- Стандарт написания запросов для управления данными

//    https://trofimovdigital.ru/blog/mysql-command-line
    /*

    https://youtu.be/kVzcaiq_9Fw?si=kXpeohA0MpyOW6kS&t=442

    SQL (Structured Query Language) – язык структурированных запросов. Он является основным инструментом для работы
    с большими информационными объемами. Относятся к декларативным языкам программирования, но не выступает в качестве
    полноценного средства разработки.

        */
}


