package Archive._2PrimitiveTypes.UpravlyauschieKonstrukcii.Tasks;

public class Faktorial_Rekursivnii_Metod {
//=====================================================================================================================
      /*Рекурсия — это выполнения некоторой логики путем вызова методом самого себя. Такой метод называют рекурсивным.
      Он состоит из двух частей:
      1. Условие выхода из метода, при достижении которого метод должен перестать вызывать самого себя.
      2. Некоторая обработка (логика), необходимая в данной ситуации + вызов самого себя, но уже с другим входящим значением
      */
//=====================================================================================================================
    public static void main(String[] args) {
        getFactorial(4);
        System.out.println(getFactorial(4));
    }
    public static int getFactorial(int f) {
        if (f <= 1) {
            return 1;
        }
        else {
            return f * getFactorial(f - 1);
        }
    }


}
