package Archive._2PrimitiveTypes.UpravlyauschieKonstrukcii.Tasks;

public class Ternarnii_Operator {
    /*=============================================================================================================
    что бы вызвать (не static метод) в static методе надо создать объкт класса в static методе и через этот объект
    вызвать этот (не static метод). Модификатор static обозначает, статический контекст, то есть тебе не нужно
    создавать экземпляр класса, чтобы работать с этим методом.
    ================================================================================================================*/
    public static void main(String[] args) {

        Ternarnii_Operator group = new Ternarnii_Operator();
        System.out.println(group.determineGroup(32));
    }

    public int determineGroup(int age) {
        return (age >= 7 && age <= 13) ? 1 :
                (age >= 14 && age <= 17) ? 2 :
                        (age >= 18 && age <= 65) ? 3 : -1;
    }//================================================================================================================
/*  (тернарный оператор - ?) https://javarush.com/groups/posts/ternarnyj-operator
result = условие? true : false
условие перед ? после возврат если условие true : после возврат если false  */
}
/* ====================================================================================================================
В спортивном центре есть три возрастные группы для занятий волейболом 1 - от 7 до 13 лет 2 - от 14 до 17 лет
3 - от 18 до 65 лет. Напишите публичный нестатичный метод determineGroup который принимает возраст человека и
возвращает целое число, которое обозначает номер группы в которую его надо определить, если подходящей группы
нет - верните -1.
Пример ввода: 10
Пример вывода: 1
Пример ввода: 60
Пример вывода: 3
Пример ввода: 77
Пример вывода: -1
Требования:
Сигнатура метода должна быть: determineGroup(int age)
Метод должен возвращать int
Метод не должен быть статическим
 =====================================================================================================================*/