package Archive._2PrimitiveTypes.UpravlyauschieKonstrukcii.Tasks;
/*======================================================================================================================
Делаю цикл, который инициализирует каждый элемент массива с индексом i , кроме последнего элемента массива,и если
значение этого элемента с индексом i нечетное (то есть имеет остаток от деления на 2) вывожу этот элемент в печать
+ ", ". После вывода цикла, вывожу последний элемент массива на печать, если его значение нечетное + "\n"
======================================================================================================================*/
public class VivodNechetnihChiselIzMassiva2416 {
    public static void main(String[] args) {
        printOddNumbers(new int []{2});
    }
    public static void printOddNumbers(int[] arr){
        if (arr.length != 0) {
            for (int i = 0; i < arr.length; i++) {
                if (Math.abs(arr[i] % 2) > 0) {
                    System.out.print(arr[i] + ",");
                }
            }
            System.out.println("\b");
        } else {
            System.out.println();
        }
    }
}
/*=====================================================================================================================
Напишите метод printOddNumbers, который принимает массив и выводит в консоль только нечетные числа из него,
через запятую. Конец вывода должен перевести курсор на новую строку.

Пример ввода: [3,5,20,8,7,3,100]
Пример вывода: 3,5,7,3
Требования:
Сигнатура метода должна быть: printOddNumbers(int[] arr)
======================================================================================================================*/
